src/sw-screencast.org
#+TITLE: Screencast Software/录屏软件

-----
* 功能介绍                                                        :screencast:screen capture:
录屏软件(screencast or screen capture)用来录制计算机屏幕输出, 一般也会包含音频
输出或麦克输入. 完整的名词解释参见[[https://en.wikipedia.org/wiki/Screencast][WIKI]]. 录屏在技术分享和在线教领域有广泛使用.

本文介绍Windows/Linux两个系统下开源/自由的优秀录屏软件.

* Windows平台
** Sharex
**** 介绍
ShareX是自由/开源软件, 基于.NET开发, 只能运行在Windows系统上. 支持截屏/录屏, 并
进行各种各样的分享. 界面支持多语言. [[https://en.wikipedia.org/wiki/ShareX][WIKI]]和[[https://zhuanlan.zhihu.com/p/19627720][知乎]]有介绍.
- 代码: [[https://github.com/ShareX/ShareX][github]]
- 主页: https://getsharex.com/
- 下载: [[https://getsharex.com/downloads/][Downloads]]
**** 配置
在[[https://getsharex.com/][主页]]上可找到完整的介绍文档. 默认使用=Shift+PrtSc=组合键启动/停止录屏. 启动时
拖曳鼠标修改录屏区域. 录屏默认配置未包含音频, 按照下述配置打开:
- EN
  + Task settings->Capture->Screen recorder->Screen recorder options
  + In 'Audio source' select MIC or  appropriate audio source.
- CN
  + 任务设置->截图->屏幕记录->屏幕录制选项
  + 在'音频源'中选择麦克风或适当的音频源
