sw-screencast.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-23 Sun 12:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Screencast Software/录屏软件</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="U-HOME\yanyg" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Screencast Software/录屏软件</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6ff9313">1. 功能介绍                                                        :screencast:screen capture:</a></li>
<li><a href="#orgf86cafb">2. Windows平台</a>
<ul>
<li><a href="#org76b9cd9">2.1. Sharex</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />
<div id="outline-container-org6ff9313" class="outline-2">
<h2 id="org6ff9313"><span class="section-number-2">1</span> 功能介绍                                                        :screencast:screen capture:</h2>
<div class="outline-text-2" id="text-1">
<p>
录屏软件(screencast or screen capture)用来录制计算机屏幕输出, 一般也会包含音频
输出或麦克输入. 完整的名词解释参见<a href="https://en.wikipedia.org/wiki/Screencast">WIKI</a>. 录屏在技术分享和在线教领域有广泛使用.
</p>

<p>
本文介绍Windows/Linux两个系统下开源/自由的优秀录屏软件.
</p>
</div>
</div>

<div id="outline-container-orgf86cafb" class="outline-2">
<h2 id="orgf86cafb"><span class="section-number-2">2</span> Windows平台</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org76b9cd9" class="outline-3">
<h3 id="org76b9cd9"><span class="section-number-3">2.1</span> Sharex</h3>
<div class="outline-text-3" id="text-2-1">
</div><ol class="org-ol"><li><a id="org972ab4e"></a>介绍<br /><div class="outline-text-5" id="text-2-1-0-1">
<p>
ShareX是自由/开源软件, 基于.NET开发, 只能运行在Windows系统上. 支持截屏/录屏, 并
进行各种各样的分享. 界面支持多语言. <a href="https://en.wikipedia.org/wiki/ShareX">WIKI</a>和<a href="https://zhuanlan.zhihu.com/p/19627720">知乎</a>有介绍.
</p>
<ul class="org-ul">
<li>代码: <a href="https://github.com/ShareX/ShareX">github</a></li>
<li>主页: <a href="https://getsharex.com/">https://getsharex.com/</a></li>
<li>下载: <a href="https://getsharex.com/downloads/">Downloads</a></li>
</ul>
</div></li>
<li><a id="orgaeb63f1"></a>配置<br /><div class="outline-text-5" id="text-2-1-0-2">
<p>
在<a href="https://getsharex.com/">主页</a>上可找到完整的介绍文档. 默认使用=Shift+PrtSc=组合键启动/停止录屏. 启动时
拖曳鼠标修改录屏区域. 录屏默认配置未包含音频, 按照下述配置打开:
</p>
<ul class="org-ul">
<li>EN
<ul class="org-ul">
<li>Task settings-&gt;Capture-&gt;Screen recorder-&gt;Screen recorder options</li>
<li>In 'Audio source' select MIC or  appropriate audio source.</li>
</ul></li>
<li>CN
<ul class="org-ul">
<li>任务设置-&gt;截图-&gt;屏幕记录-&gt;屏幕录制选项</li>
<li>在'音频源'中选择麦克风或适当的音频源</li>
</ul></li>
</ul>
</div></li></ol>
</div>
</div>
</div>
</body>
</html>
